manthan-ladva/Embedded-Projects/STM32-Projects-main/Led/Official_demo_led_stm/src/main.c
#include "stm32f4xx.h"


void Init_gpio(void);
void Delay(unsigned int time);
void Pattern1(void);
void Pattern2(void);


GPIO_InitTypeDef   All_Led;


int main(void)
{
	Init_gpio();
	while (1)
	{
		Pattern1();
		Pattern2();
		GPIO_WriteBit(GPIOD, GPIO_Pin_12|GPIO_Pin_13|GPIO_Pin_14|GPIO_Pin_15, Bit_RESET);
		Delay(1000);
	}
}


void Pattern1(void)
{
	unsigned int i;
	for(i=0;i<3;i++)
	{
		GPIO_WriteBit(GPIOD, GPIO_Pin_12, Bit_SET);
		Delay(100);
		GPIO_WriteBit(GPIOD, GPIO_Pin_12, Bit_RESET);
		Delay(100);

		GPIO_WriteBit(GPIOD, GPIO_Pin_13, Bit_SET);
		Delay(100);
		GPIO_WriteBit(GPIOD, GPIO_Pin_13, Bit_RESET);
		Delay(100);

		GPIO_WriteBit(GPIOD, GPIO_Pin_14, Bit_SET);
		Delay(100);
		GPIO_WriteBit(GPIOD, GPIO_Pin_14, Bit_RESET);
		Delay(100);

		GPIO_WriteBit(GPIOD, GPIO_Pin_15, Bit_SET);
		Delay(100);
		GPIO_WriteBit(GPIOD, GPIO_Pin_15, Bit_RESET);
		Delay(100);
	}
}


void Pattern2(void)
{
	unsigned int i;
	for(i=0;i<5;i++)
	{
		GPIO_WriteBit(GPIOD, GPIO_Pin_12|GPIO_Pin_13|GPIO_Pin_14|GPIO_Pin_15, Bit_SET);
		Delay(100);
		GPIO_WriteBit(GPIOD, GPIO_Pin_12|GPIO_Pin_13|GPIO_Pin_14|GPIO_Pin_15, Bit_RESET);
		Delay(100);
	}
}


void Init_gpio(void)
{
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);

	All_Led.GPIO_Pin = GPIO_Pin_12|GPIO_Pin_13|GPIO_Pin_14|GPIO_Pin_15;
	All_Led.GPIO_Mode = GPIO_Mode_OUT;
	All_Led.GPIO_Speed = GPIO_Speed_50MHz;
	All_Led.GPIO_OType = GPIO_OType_PP;

	GPIO_Init(GPIOD, &All_Led);
}


void Delay(unsigned int time)
{
	unsigned int i;
	for(i=0; i<time*4000; i++);
}
